#@SkillsSearch
#Feature: Поиск по навыкам
#  Как пользователь
#  Я хочу выполнять поиск по навыкам
#  Чтобы найти соответствующие результаты
#
#  @Search
#  Scenario: Поиск - Проверка результатов по навыкам
#   Given Дано, что я нахожусь на странице карьеры Epam
#   When И я принимаю все файлы cookie на сайте Epam
#   When Дано, что я нахожусь на странице карьеры Epam2
#   When Когда я выбираю навыки "Marketing and Communications" и "Business and Data Analysis"
#   When И я нажимаю кнопку "Поиск"
#   Then Тогда я проверяю, что результаты поиска содержат следующие ожидаемые значения